Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob2sme/facta/skuvlahistorja1/bergh_s.html.tmx
Source language: sme
Languages: nob

source: På norsk
nob: Sámegillii

source: Artihkal girjjis Sámi skuvlahistorjá 1 .
nob: Artikkel i boka Samisk skolehistorie 1 .

source: Mu jagit Skuvvanvári skuvllas
nob: Mine år på Skoganvarre skole

source: Skuvvanvári stuoraskuvla 1962 čavčča : Čohkkut gurut bealde : Johan Mathis Eira , Kurt Stene , Johannes Guttorm , Knut Stene , Harald Johansen og / ja Terje Amundsen .
nob: Storskolen i Skoganvarre høsten 1962 : Sittende fra venstre : Johan Mathis Eira , Kurt Stene , Johannes Guttorm , Knut Stene , Harald Johansen og / ja Terje Amundsen .

source: Čuožžut gurut bealde : Jan Johansen , Inger Anna Johansen , Inga Eira , Åse Amundsen , Inger Johansen , Georg Johansen ja Willy Grøtte .
nob: Stående fra venstre : Jan Johansen , Inger Anna Johansen , Inga Eira , Åse Amundsen , Inger Johansen , Georg Johansen og Willy Grøtte .

source: Oahpaheaddji : Richard Bergh ( Foto : Birgit Bergh )
nob: Læreren : Richard Bergh ( Foto : Birgit Bergh )

source: Richard Bergh lea riegádan Skienis 1930:s. 1950- ja -60-loguin lei son oahpaheaddjin máŋgga sajis Davvesiiddas ja Porsáŋggus .
nob: Richard Bergh er født i Skien i 1930 . På 1950- og 60-tallet var han lærer flere steder i Lebesby og Porsanger .

source: Go son álggii oahpaheaddjin Finnmárkui , de sus ii lean oahpaheaddjioahppu , muhto son čađahii maŋŋá oahpaheaddjiskuvlla Romssas ja šattai skuvlahoavdan Skuvvanváris ovdalgo vulggii fas máttás 1969:s .
nob: Da han starta sin lærerkarriere i Finnmark hadde han ikke lærerutdanning , men han tok seinere lærerskolen i Tromsø og avanserte til skolestyrer i Skoganvarre før han dro sørover i 1969 .

source: Dan maŋŋá lea son orron Hjørungavågas Sunnmøres .
nob: Siden har han bodd i Hjørungavåg på Sunnmøre .

source: Richard Bergh lea dovdosamos iežas muitalus- ja álbmotmuitogirjjiid dihtii .
nob: Richard Bergh er mest kjent for sine mange bøker med fortellinger og folkeminner .

source: Davvesiidda áigodagas čálii son Når vi sitt her å prate ( Dásgo mii čohkohallat ja háleštat ) ja Mørketid 1944 ( Skábma 1944 ) , Porsáŋggus earret eará Tro og trolldom ( Osku ja noaidevuohta ) , Skuvvanvárri ja ráiddu Det susende fjell I-IV ( Šuvvi várri , I-IV ) .
nob: Fra tida i Lebesby har han skrevet Når vi sitt her å prate og Mørketid 1944 , fra Porsanger blant annet Tro og trolldom , Skuvvanvárri og serien Det susende fjell , I-IV .

source: Geasset 1989 heaittihuvvui Skuvvanvári skuvla .
nob: Sommeren 1989 ble Skoganvarre skole nedlagt .

source: Ii lean maid láitit skuvlla heaittiheami oktavuođas ; dušše njeallje dahje vihtta oahppi ledje skuvllas maŋimus jagi .
nob: Det var ikke noe å si på nedleggingen ; bare fire eller fem elever gikk på skolen det siste året .

source: Dál Skuvvanvári gilisearvi geavaha riepmosála .
nob: Nå disponerer Skoganvarre bygdelag festsalen .

source: Muđui visti lea soahtehistorjjálaš dávvirvuorkán .
nob: Resten av bygget er blitt krigshistorisk museum .

source: Doppe lea maiddái noaiddi Johan Kaavena ossodat ja su niestebumbá lea váldogeasuhussan .
nob: Der er også en avdeling om noaiden Johan Kaaven med hans matkiste som hovedattraksjon .

source: Skuvvanvárri lea Leavnnjaleagi bajimus gilli , sullii gaskkamuttus Leavnnja ja Kárášjoga .
nob: Skoganvarre ligger øverst i Lakselvdalen , omtrent midtveis mellom Lakselv og Karasjok .

source: Dat lea okta dain čábbámus giliin maid dieđán .
nob: Den er en av de vakreste bygder jeg kjenner .

source: Guovlu lea šattolaš stuorra beahce- ja soahkevuvddiiguin , ja šelges jogaiguin ja jávrriiguin .
nob: Landskapet er frodig , med store furu- og bjørkeskoger og blinkende elver og vann .

source: Gilis oarjjás ja nuorttas badjánit alla gáissát .
nob: Både vest og øst for bygda hever store gaisser seg .

source: Bajitjávrris lea gáhttejuvvon Sieidesuolu gosa sápmelaččat áiggiid mielde leat oaffaruššan bohccuid ipmiliiddáseaset .
nob: I Øvrevann ligger den fredede Sieidesuolu ( Offerholmen ) hvor samene ned gjennom tiden ofret reinsdyr til sine guder .

source: Skuvvanvárrái ásaiduvvagohte olbmot sullii jagi 1850 .
nob: Skoganvarre fikk fast bebyggelse omkring år 1850 .

source: Dalle bođii Stávrun-Lemet , Klemet Helander , Suomabealde ja ásaiduvai Bajitjávregáddái .
nob: Da kom Klemet Helander fra Finland og bosatte seg ved Øvrevann .

source: Son náitalii badjenieiddain .
nob: Han giftet seg med en fjellsamepike .

source: Sullii seamma áigge huksejuvvui duottarstohpu Greineranjárgii .
nob: Omtrent samtidig ble fjellstua bygd på Greinernesset .

source: Hálddašeaddjin ledje eanaš dážat .
nob: Oppsitterne var for det meste norske .

source: Ođđa skuvla ođđa skuvlabiirres
nob: Ny skole i ny skolekrets

source: Mun gohčodan logijagi 1960:s gitta 1970:i iežan gollejahkin .
nob: Jeg kaller tiåret fra 1960 til 1970 for mine gyldne år .

source: Mun gávdnen iežan guoimmi 1960:s , náitalin 1961:s , ja nu mánná máná maŋis riegádii .
nob: Jeg traff min kvinne i 1960 , ble gift i 1961 , og den ene ungen kom etter den andre .

source: Na , eai dat dal šaddan eanet go golbma oktiibuot .
nob: Ja , det ble ikke mer enn tre til sammen .

source: Muhto go riegádit unnoraččat badjálagaid , de dovdo dego dállu livččii dievva gášvvardahkes , rieddji sivdnádusaiguin .
nob: Men når man får noen smårollinger som perler på en snor , høres det som om hele huset er fullt av sprellende , ropende vesener .

source: Ja 1962:s moai Birggehiin oaččuime barggu dan áibbas ođđa skuvllas , áibbas ođđa Skuvvanvári skuvlabiirres .
nob: Og i 1962 ble Birgit og jeg ansatt på den flunkende nye skolen i den flunkende nye skolekretsen Skoganvarre .

source: Munnuide lei dát álgu niehkojagiide .
nob: For oss ble dette begynnelsen på noen eventyrlige år .

source: 1950-logu loahpas ledje ollu skuvlamánát Skuvvanváris .
nob: På slutten av 1950-tallet var det mange skolebarn i Skoganvarre .

source: Sii orro internáhtas Smørstad nammasaš báikkis Leavnnjas skuvlla váccedettiin ja ahkidušše , erenoamážit unnimusat .
nob: De bodde på internatet på Smørstad i Lakselv under skolegangen , og mistrivdes , særlig de minste .

source: Sivert Amundsen lei válljejuvvon skuvlastivrii .
nob: Sivert Amundsen var blitt valgt inn i skolestyret .

source: Son lei ollu háleštan iežas gili olbmuiguin hukset sierra skuvlla Skuvvanvárrái .
nob: Han hadde snakket mye med sine sambygdinger om egen skole for Skoganvarre .

source: Vuosttamus áššin ođđa skuvlastivralahttun son evttohiige hukset skuvlla ruovttugillái .
nob: En av de første sakene han som nybakt skolestyremedlem tok opp , var nettopp å få bygd skole i hjembygda .

source: Sus ledje alddis máŋga máná - sihke vuollel skuvlaagi ja skuvlaagis .
nob: Han hadde selv flere barn - både under og i skolealder .

source: Son háliidii ahte sii galge beassat orrut ruovttus skuvlla váccedettiin .
nob: Han ville gjerne la dem bo hjemme i skoletiden .

source: Skuvlastivrras su dorjo suohkanbáhppa Elvenes ja Gunhild Bjørklid , ja maiddái iežas viellja Hans A. Opstad , gii lei válljejuvvon sátnejođiheaddjin .
nob: I skolestyret fikk han støtte fra sokneprest Elvenes og Gunhild Bjørklid , også av sin bror Hans A. Opstad , som var blitt ordfører .

source: Buori doarjaga fidnii son maiddái skuvladárkkásteaddjis Harald Dahlas ja skuvladirektevrras Arthur Gjermundsenas .
nob: God støtte fikk han også av skoleinspektør Harald Dahl og skoledirektør Arthur Gjermundsen .

source: Mearrádus hukset skuvlla Skuvvanvárrái menestuvai álkidit sihke skuvlla- ja gielddastivrras .
nob: Vedtaket om å bygge en skole i Skoganvarre gikk således lett igjennom både i skole- og kommunestyre .

source: Dan rájes go internáhta huksejedje Smørstadii 1910:s , ledje Skuvvanvári oahppit vázzán skuvlla Leavnnjas .
nob: Helt siden internatet ble bygd på Smørstad i 1910 hadde elevene fra Skoganvarre gått på skole i Lakselv .

source: Doppe ledje sii orron vahkku háválassii ja vahkkoloahpaid sii manne vácci ruoktot , oktiibuot golbma miilla .
nob: Der hadde de bodd en uke av gangen og spasert hjem til Skoganvarre i helgene , hele tre mil .

source: Gili vuorrasut olbmot muitaledje munnje nuppát ahkidis muitalusa váivves skuvladili birra - givssideami birra internáhtas ja bávččas ruoktoáibbbašeami birra .
nob: Jeg hørte mangen en trist historie fra den eldre generasjonen i bygda om en vond skoletid - med mobbing på internatet og sår hjemlengsel .

source: Ledje stuorát riemut gilis go skuvla vihahuvvui golggotmánus 1962 .
nob: Det var stor festivitas i bygda da skolen ble innviet i oktober 1962 .

source: Sii ledje čiŋahan riemuide lášmmohallan- ja feastasálas .
nob: Det var pyntet til fest i den kombinerte gymnastikk- og festsalen .

source: Doppe ledje allaáiggálaš sártnit , ja de lei čoavdagiid geigen - nuppis nubbái .
nob: Det var høytidelige taler , og det var overrekking av nøkler - fra den ene til den andre .

source: Loahpas ledje čoavdagat mu gieđas .
nob: Til slutt stod jeg med nøklene i hånden .

source: Skuvla lei mu !
nob: Skolen var min !

source: 2. ja 3. jahkebuolva 1962 čavčča .
nob: 2. og 3. årskull høsten 1962 .

source: Čohkkame gurut bealde : Ole Henriksen , Tor Amundsen , Nils Utsi , Kato Stene ja Reidar Johansen .
nob: Sittende fra venstre : Ole Henriksen , Tor Amundsen , Nils Utsi , Kato Stene og Reidar Johansen .

source: Čuožžume : Torill Grøtte , Anne Lise Johansen , Berit Johansen , Anne Kirsten Eira ja Marit Utsi .
nob: Stående : Torill Grøtte , Anne Lise Johansen , Berit Johansen , Anne Kirsten Eira og Marit Utsi .

source: Oahpaheaddji : Birgit Bergh
nob: Læreren : Birgit Bergh

source: ( Govva : Richard Bergh )
nob: ( Foto : Richard Bergh )

source: Ii leat álo nu álki leat oahpaheaddjin aiddo ásahuvvon skuvlabiirres .
nob: Det er ikke alltid så lett å være lærer i en nyetablert skolekrets .

source: Olbmot eai lean hárjánan dasa ahte gilis lei skuvla , ja máŋggas eai áibbas jáhkkán ahte oahpaheaddjis lei nu ollu bargu .
nob: Folk var ikke vant til å ha en skole i bygda , og mange var ikke helt klar over at lærerne kunne ha mye å gjøre .

source: 1960-logus eai lean nu máŋga biilla Skuvvanváris , ja busse Kárášjoga ja Leavnnja gaskka ii mannan nu beare dávjá .
nob: Det var ikke mange biler i Skoganvarre på 1960-tallet , og bussen mellom Karasjok og Lakselv gikk ikke altfor ofte .

source: Danin bohte duollet dálle olbmot skuvlii jearrat biilasáhtu Levdnjii - ja muhtumin Kárášjohkii .
nob: Det kom derfor av og til folk innom skolen og ba om bilskyss til Lakselv - og noen ganger til Karasjok .

source: Mun vuojihin olbmuid nu dávjá go sáhtten , muhto eai buohkat ádden ahte mun sáhtten leat doaimmas maiddái maŋŋelgaskabeaivve skuvlabargguiguin .
nob: Jeg kjørte folk så ofte jeg hadde anledning , men ikke alle skjønte at jeg kunne være opptatt også om ettermiddagene med skolearbeid .

source: Guovtti áiggehan skuvlabeaivi nogai , ja dan maŋŋá jáhkke máŋggas ahte oahpaheaddjit ledje joavdelassan gitta nuppi iđidii , ja ahte reastabeaivve sii sáhtte leat vuoddjin !
nob: Klokken to sluttet jo skoledagen , og da trodde mange at lærerne var frie og franke til neste morgen , og kunne være sjåfører resten av dagen !

source: Nuppi láhkai fas de šattaimet mii ja olles gilli stuorra bearašin .
nob: På den annen side ble vi og hele bygda som en stor familie .

source: Olbmot bohte dávjá gallestallat , ja ledje hirbmat veahkkái .
nob: Folk kom innom på besøk , og var utrolig hjelpsomme .

source: Skuvlla ledje huksen duottarstohponjárgii .
nob: Skolen var bygd på fjellstuenesset .

source: Vuolábealde skuvlašilju lei duottarstobu geađgejuolgi ja dán dálu ledje duiskalaččat boaldán 1944 čavčča seamma láhkai go muđuige gili .
nob: Nedenfor skolegården lå grunnmuren etter fjellstua , som tyskerne svidde av høsten 1944 sammen med resten av bebyggelsen .

source: Dušše návet lei báhcán .
nob: Bare fjøset stod igjen .

source: Skuvvanvári skuvlabiire lei hui viiddis , vaikko eai lean nu ollu olbmot geat orro doppe .
nob: Skoganvarre skolekrets var meget stor i utstrekning , selv om det ikke var så mange folk som bodde i den .

source: Dán biirii gulle maiddái Lávkajávri ja Sávnnjojávri .
nob: Den omfattet også Lávkajávri og Sávnnjojávri .

source: Oahppit dáin skuvlabiirre boaittobeale guovlluin fertejedje olbmuid luhtte orrut skuvlla váccedettiin .
nob: Elevene fra disse utkantene av skolekretsen måtte innlosjeres i skoletiden .

source: Lávkajávrri oahppit orro Marie Stene luhtte , gii lei skuvlla lagamus kránnjá .
nob: Elevene fra Lávkajávri ble plassert hos Marie Stene , som var skolens nærmeste nabo .

source: Sávnnjojávrri mánát orro Anna ja Trygve Opdahl luhtte .
nob: Elevene fra Sávnnjojávri bodde hos Anna og Trygve Opdahl .

source: Dološ muitalusat
nob: Fortellinger fra gamle dager

source: Mun lávejin dávjá gallestallat Marie Stene ja Anna-guovtto Trygve Opdahlain .
nob: Jeg gikk ofte på besøk både til Marie Stene og Anna og Trygve Opdahl .

source: Sii ledje čeahpit muitalit gili dološ áiggiid birra , ja muitalusaid mun čállen .
nob: De var flinke til å fortelle om gamle dager i bygda , og historiene skrev jeg ned .

source: Márjá mielalaččat muitalii mo lei go soai Hilmariin ásaiga ávdin Gáirrasguolbanii gaskkamuttus Leavnnja ja Skuvvanvári ja geahččaleigga ođđaássin álgit ; mo soai jođiiga viidáseappot Luostejohkii ja álggiiga eanandoaluin doppe .
nob: Marie fortalte gjerne om da hun og Hilmar slo seg ned på den øde Gairas-moen mellom Lakselv og Skoganvarre og forsøkte seg som nybyggere ; hvordan de flyttet videre til Luostejohka og dyrket jorden der .

source: Maŋŋá soađi soai huksiiga iežaska dáláš ruovttu Skuvvanvárrái .
nob: Etter krigen bygde de sitt nåværende hjem i Skoganvarre .

source: Hilmar lei maiddái bargan rávdin geaidnodoaimmahagas .
nob: Hilmar hadde vært ansatt som smed i veivesenet .

source: Trygve lei Oline ja Anders Opdahla , duottarstohpohálddašeaddji-guoktá bárdni .
nob: Trygve var sønn av fjellstueoppsitterne Oline og Anders Opdahl .

source: Oline lei eret Skiervvás ja Anders fas Gåebries ( Plassje , Røros ) .
nob: Oline var fra Skjervøy og Anders fra Røros-traktene .

source: Trygve hálai njuovžilit sihke dáro- , sámi- ja kveanagiela .
nob: Trygve snakket flytende både norsk , samisk og kvensk .

source: Go sápmelaččat norde oaivvi giellamuvrra vuostá go deaivvadedje dáža byrokratiijain , de lei Trygve gearggus veahkehit .
nob: Når samene stanget hodet mot språkmuren i sitt møte med det norske byråkratiet , var Trygve til stor hjelp .

source: Son doaimmai ášševuoddjin , sáddii čállosiid duohkot deike iežas báikkiolbmuid ovddas .
nob: Han var som en advokat , han sendte skriv i øst og vest for sine sambygdinger .

source: Trygve oaččui gonagasa ánsomedálja dán barggu ovddas .
nob: Trygve fikk kongens fortjenstemedalje av den grunn .

source: Anna eatnigiella lei kveanagiella ; son lei eret Klemetstadas Leavnnjaleagis .
nob: Annas morsmål var kvensk ; hun var fra Klemetstad i Lakselvdalen .

source: Son lei jaskes ja ujus nissonolmmoš , ja čohkkái muorrakássa alde uvdnagáttis ja guldalii hálešteami gievkkanbeavddi birra .
nob: Hun var en stille og beskjeden kvinne , som satt på vedkassen ved ovnen og lyttet til samtalen rundt kjøkkenbordet .

source: 1964:s huksejuvvui turistaguovddáš gohttenbarttaiguin skuvlla vuolábeallái .
nob: I 1964 ble et turistsenter med campinghytter bygd nedenfor skolen .

source: Muhtun láhkai buorre sadji ja buorre árbevieru joatkka .
nob: For så vidt en bra plassering og en god tradisjon å ta vare på .

source: Dies han leage leamaš Finnmárkku boarráseamos duottarstohpu .
nob: Der hadde jo Finnmarks eldste fjellstue ligget .

source: Muhto skuvlii ii lean nu buorre diekkár kránnjá oažžut .
nob: Men det var ikke så heldig for skolen å få en slik nabo .

source: Máŋga guossi bohte vahkkoloahpaid Skuvvanvárrái albma feastta časkit .
nob: Mange av gjestene kom til Skoganvarre i helgene for å få seg en real fest .

source: Lei ollu huikkas ja riedja barttain .
nob: Det lød mye skrik og skrål fra hyttene .

source: Gal ledje eatnat vuollabohtalat maid mun čoggen skuvlla lagasbirrasis .
nob: Det var ikke få ølflasker jeg plukket opp i området rundt skolen .

source: 2 1/2 oahpaheaddji
nob: 2 ½ lærer

source: Skuvvanvári skuvla lei ovtta gearddis , mii eat dárbbašan tráhpáid goargŋut .
nob: Skoganvarre skole hadde alt på én flate , vi slapp å løpe i trapper .

source: Doppe ledje guokte klássalanja , okta joavkolatnja ja riepmosálla .
nob: Det var to klasserom , et grupperom og en festsal .

source: Dása lassin lei oahpaheaddjilatnja feaskára geažis , ja hoavdda ássandállu das dastán skuvlanurkkis .
nob: I tillegg var der et lærerrom i enden av korridoren , og en styrerbolig like ved skolebygget .

source: Oahpaheaddjilanja mii geavaheimmet orrunlatnjan .
nob: Lærerrommet ble brukt som hybel .

source: Mu áigodagas Skuvvanváris lei skuvla golmma juogus .
nob: I min tid i Skoganvarre var skolen tredelt .

source: Máŋga oahppi eai máhttán dárogiela go skuvlii álge .
nob: Mange av elevene kunne ikke norsk når de begynte på skolen .

source: Dán sivas divttiimet vuosttaš luohká leat sierra luohkkán .
nob: Av den grunn lot vi første årskull være egen klasse .

source: Nuppi ja goalmmát luohkkálaččat ledje ovttas klássalanjas .
nob: Andre og tredje årskull var én klasse .

source: Goalmmát joavkkus ledje njealjádis gitta čihččet luohkkálaččaid rádjái .
nob: Den tredje klassen var årskullene fjerde til syvende klasse .

source: 1963:s álggahii Porsáŋggu gielda - dahje Kistrand ( Goahgieddi ) nugo gieldda namma lei ovdal - ovccijagi skuvlla .
nob: I 1963 innførte Porsanger kommune - eller Kistrand som den het den gang - niårig skole .

source: Dan rájes de vázze čihččetluohkkálaččat nuoraidskuvlla Leavnnjas .
nob: Fra da av gikk syvende årskull på ungdomsskolen i Lakselv .

source: Vuosttaš jagiid ledje guokte olles ja okta bealle oahpaheaddjivirggi .
nob: De første årene var det to fulle og en halv lærerstilling .

source: Munnos Birggehiin ledje olles virggit , beallevirggis lei studeanta , ja ođđa bođii juohke jagi .
nob: Birgit og jeg hadde de hele stillingene , den halve ble besatt av en student , som skiftet fra år til år .

source: 1966:s beallevirgi rievddai olles virgin .
nob: I 1966 ble den halve stillingen utvidet til en hel .

source: Sverre Hatle oaččui dán virggi .
nob: Sverre Hatle fikk stillingen .

source: Son lei Romsdalas eret .
nob: Han var romsdaling .

source: Oahpaheaddjiskuvllas oahpai son ieš - asttuáiggis - čálalaš sámegiela , ja njálmmálaš giela fas go bođii Skuvvanvárrái .
nob: På lærerskolen lærte han seg - på sin fritid - samisk skriftlig , og muntlig da han kom til Skoganvarre .

source: Ledje sullii golbmalogi oahppi skuvlla álgojagi .
nob: Det var omlag tredve elever i skolens første år .

source: Lohku bisui badjelaš golbmalogis - muhtumin aiddo vuolábealde - dieid jagiid go mun ledjen skuvlajođiheaddjin gilis .
nob: Tallet holdt seg over tredve - kanskje så vidt under noen ganger - de årene jeg var skolestyrer i bygda .

source: Dát lei aiddo muttát lohku vai šattai buorre biras .
nob: Det var passelig mange til å skape et godt miljø .

source: Eat oktiige vásihan skuvlla bilideami .
nob: Ikke en eneste gang opplevde vi hærverk på skolen .

source: Ii oktage glássa cuvkejuvvon !
nob: Ikke en knust rute !

source: Ii oktage seaidni lean sárggoduvvon .
nob: Ikke en eneste tagging på veggene .

source: Oahppit besse mannat gosa áigo , mis eai lean lohkkaduvvon skuvlauvssat .
nob: Elevene kunne gå hvor de ville , vi hadde ikke stengte skoledører .

source: Árrat iđđedis mun rahpen skuvlaolgouvssa .
nob: Tidlig om morgenen låste jeg opp ytterdøren til skolen .

source: De besse oahppit - dađistaga go bohte - mannat liegga feaskárii ja čohkkát vuollegas ja govda glássagárpmaid alde .
nob: Så kunne elevene - etter hvert som de kom - gå inn i en varm korridor og bruke de lave og brede vinduskarmene til stoler .

source: Dán láhkai sii eai dárbbašan olgun čuožžut ja goallut buollašis .
nob: De slapp å stå ute og fryse i kulda .

source: Mii dávjá geavaheimmet meahci oahpahusas .
nob: Vi brukte ofte naturen i undervisningen .

source: Mis ledje luohkkámátkkit oarjjás Vuolajohleahkái .
nob: Vi hadde klasseturer vestover til Vuolajohkdalen .

source: Mii láviimet finadit nuortan Gággajávrris .
nob: Vi gikk turer østover til Gággajávri .

source: Oahpaheaddjit ja oahppit gorgno Stálločohkkii .
nob: Lærere og elever besteg Stálločohkka .

source: Oahppit oahpahedje midjiide dola cahkkehit meahcis sihke geasset ja dálvet .
nob: Elevene lærte oss å tenne bål i skog og mark både sommer og vinter .

source: Mun ledjen áŋgir čohkket oapmegirjjiid .
nob: Jeg var en ivrig samler av antikvarisk litteratur .

source: Oapmegirjegávppiin Oslos ja Troandimis fidnejin girjelisttuid .
nob: Fra antikvariater i Oslo og Trondheim fikk jeg boklister .

source: Mun erenoamážit beroštišgohten girjjiin Finnmárkku birra .
nob: Jeg ble særlig interessert i bøker om Finnmark .

source: Árrat fuomášin ahte Skuvvanvárri lei namahuvvon máŋgga boares girjjis .
nob: Jeg ble tidlig oppmerksom på at Skoganvarre var nevnt i mange eldre publikasjoner .

source: Oaffarsullo ja duottarstobu birra čuoččui erenoamáš olu .
nob: Offerholmen og fjellstua har fått særlig mye omtale .

source: Árbevirolaš gilli
nob: Bygd med tradisjoner

source: Skuvlla vuolábealde ledje duottarstobu duktásajit , ja duottarstobus ledje hui rikkis árbevierut doložis .
nob: Nedenfor skolen lå tuftene til fjellstua , som hadde så rike tradisjoner å se tilbake på .

source: Dat lei huksejuvvon 1853:s , ja dat lei vuosttaš duottarstohpu mii huksejuvvui Finnmárkui .
nob: Den var bygd i 1853 , og var den første fjellstua som ble reist i Finnmark .

source: Riikkaoasi ledje duiskalaččat boaldán - nugo buohkat dihtet - skábman 1944 .
nob: Landsdelen var - som alle vet - blitt brent av tyskerne senhøstes 1944 .

source: Mun smiehtastin ahte dáidda historjjálaš duktásajiide mii sáhtášeimmet ráhkadit gilišilju .
nob: Jeg fikk den idéen at på disse historiske tuftene skulle vi anlegge et bygdetun .

source: Deike sáhtášeimmet maŋit áigái čohkket buot daid maid duiskalaččat eai ollen boaldit .
nob: Her kunne vi samle for ettertiden det som hadde unngått tyskernes brenning .

source: Mun registrerejin boares dáluid guovllus ja vudjen birra buot oastimin dávviriid maid sáhtášii gilišilljui vurket .
nob: Jeg registrerte gamle bygninger i området og bilte rundt for å kjøpe opp gjenstander med tanke på å plassere dem på bygdetunet .

source: Turistaguovddáža huksen bilidii dieđusge dáid áigumušaid .
nob: Byggingen av turistsenteret ødela selvsagt for disse planene .

source: Muhto dattetge gosa dal gilišillju ásahivččii , de han lei deaŧalaš vurket dološ dávviriid .
nob: Men uansett hvor bygdetunet ville komme til å ligge , var det jo viktig å ta vare på de gamle gjenstandene .

source: Mun ledjen optimista ja dollen logaldallamiid ášši birra , sihke Skuvvanváris ja Leavnnjas .
nob: Jeg var optimist og holdt foredrag om saken , både i Skoganvarre og Lakselv .

source: Mun maiddái háliidin geavahit skuvlla muhtunlágan ealli dávvirvuorkán , gos sihke ollesolbmot ja mánát sáhtte oahppat Finnmárkku vássánáiggis .
nob: Jeg ville også bruke skolen som et slags levende museum , der kunne både voksne og barn lære om Finnmarks fortid .

source: Mun čállen juohke sadjái fidnen dihtii ovdalsoahtegovaid Skuvvanváris .
nob: Jeg skrev både hit og dit for å få tak i førkrigsbilder fra Skoganvarre .

source: Daláš Aftenposten doaimmaheaddji - Hans J. Huitfeldt - fidnii munnje olles govvaalbuma maid su eadni lei govvidan Finnmárkku-mátkkis iežas vánhemiiguin 1901:s .
nob: Daværende redaktør i Aftenposten - Hans J. Huitfeldt - skaffet meg et helt album med bilder som hans mor hadde tatt på en Finnmarks-tur sammen med sine foreldre i 1901 .

source: Eanaš govat ledje sin orrumis Skuvvanvári duottarstobus .
nob: De fleste av bildene var fra oppholdet på fjellstua i Skoganvarre .
